artifacts/load_test.txt
=== Load Test Results ===
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            2443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_256_GCM_SHA384,384,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /
Document Length:        397 bytes

Concurrency Level:      3
Time taken for tests:   0.519 seconds
Complete requests:      20
Failed requests:        0
Total transferred:      34420 bytes
HTML transferred:       7940 bytes
Requests per second:    38.53 [#/sec] (mean)
Time per request:       77.870 [ms] (mean)
Time per request:       25.957 [ms] (mean, across all concurrent requests)
Transfer rate:          64.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       20   39  16.5     42      69
Processing:    10   30  15.1     32      57
Waiting:        8   26  14.3     29      52
Total:         36   69  11.0     71      82

Percentage of the requests served within a certain time (ms)
  50%     71
  66%     73
  75%     77
  80%     77
  90%     82
  95%     82
  98%     82
  99%     82
 100%     82 (longest request)